In [2]:
import pandas as pd

In [4]:
data = {
    'Name': ['mitesh', 'kunu', 'harakh', 'hiren', 'mitesh'],
    'Age': [28, 22, None, 32, 28],
    'City': ['dholka', None, 'muli', 'surendranagar', 'dholka']
}

In [6]:
df = pd.DataFrame(data)

In [8]:
df

     Name   Age           City
0  mitesh  28.0         dholka
1    kunu  22.0           None
2  harakh   NaN           muli
3   hiren  32.0  surendranagar
4  mitesh  28.0         dholka

In [10]:
missing_values = df.isnull().sum()

In [12]:
missing_values

Name    0
Age     1
City    1
dtype: int64

In [14]:
drop=df.dropna()

In [16]:
drop

     Name   Age           City
0  mitesh  28.0         dholka
3   hiren  32.0  surendranagar
4  mitesh  28.0         dholka

In [18]:
dupliction=df.drop_duplicates()

In [20]:
dupliction

     Name   Age           City
0  mitesh  28.0         dholka
1    kunu  22.0           None
2  harakh   NaN           muli
3   hiren  32.0  surendranagar